import React,{useState,useEffect} from "react";
import Image from "next/image";
import aboutImage from "../../public/images/about-img.png";


function About() {
  const [show, setShow] = useState(false);
    
    function handleToggle(){
      setShow(!show)
    }

  return (
    <>
      <section className="about_section layout_padding ">
        <div className="container  ">
          <div className="row">
            <div className="col-md-6 ">
              <div className="img-box">
                <Image
                  src={aboutImage}
                  placeholder="blur"
                  width={445}
                  height={608}
                  alt="about-image"
                />
              </div>
            </div>
            <div className="col-md-6">
              <div className="detail-box">
                <div className="heading_container">
                  <h2> درباره ما</h2>
                </div>
                <p>
                  مجموعه فودی طی سالیان گذشته با تکیه بر کسب دانش روز در صنعت
                  فست فود و به پشتوانه کوشش سرمایه های انسانی خویش هم اکنون به
                  عنوان بزرگترین مجموعه رستوران زنجیره ای در حوزه پیتزا به نام و
                  نشانی معتبر شناخته شده است. برند فودی با پیروی از شعار تجلی
                  مهندسی صنایع غذایی در هنر آشپزی سعی می کند نامی ماندگار در ذهن
                  مردم ایران باشد.
                  <br />
                  پیتزا فودی برای سلیقه و سلامت مشتری ایرانی ارزش بسیاری قائل
                  است و بر استفاده از مواد اولیه استاندارد و به حداقل رساندن
                  استفاده از سوسیس و کالباس و سایر گوشت های فرآوری شده تاکید
                  بالایی دارد. منوی پیتزا فودی همواره با تنوع بالا و نوآوری فصلی
                  مورد توجه مشتریان قرار داشته است. پیتزا‌های آمریکایی با ظاهر
                  متفاوت مثلثی شکل، پیتزاهای ایتالیایی، انواع سالاد و ساندویچ
                  های فودی همواره طرفداران ویژه ای دارند.
                  <br />
                </p>
                <p
                  style={{
                    display: show  ? "block" : "none" ,
                    position:"relative",
                  }}
                >
                  <span className="text-yellow">پیتزا فودی</span> برای خدمت
                  رسانی با کیفیت به مشتریان خود، هیچ حد و مرزی ندارد. این مجموعه
                  از مراکز شلوغ خرید گرفته تا مغازه‌های محلی، مناطق لوکس تا
                  مناطق عادی مرکز شهر و حتی از تهران تا شهرستان‌ها، امکان
                  سرویس‌دهی دارد.
                  <br />
                  <span className="text-yellow">اهداف ما</span> ارائه مواد غذایی
                  سالم و با کیفیت به مردم جامعه استفاده از مواد اولیه تازه و
                  مرغوب و عدم استفاده از مواد ناسالم مثل سوسیس و کالباس تا حد
                  امکان ارسال پیتزا و فست فود برای متقاضیانی که به صورت تلفنی یا
                  آنلاین سفارش می‌دهند در کوتاهترین زمان چشم انداز ما تبدیل
                  پیتزا فودی به محبوب‌ترین برند پیتزا دلیوری ایرانی تا سال ١٤١٤
                  <br /> پیتزا فودی به لطف آموزش استاندارد و مهندسی صنایع غذایی
                  منحصربه‌فرد، اهمیت به تنوع و نوآوری، حفظ طعم واحد در تمامی
                  شعبات، استفاده از نیروهای متخصص در هسته مرکزی، افزایش بهره‌وری
                  نیروی کار و ارزش گذاری برای مشتری، امکان تحقق این هدف را برای
                  خود میسر ساخته است.
                  <br /> <span className="text-yellow">ماموریت ما</span> ارائه
                  پیتزاهای متنوع و خوش طعم از طریق استفاده از مواد اولیه مرغوب و
                  درجه یک برای بدنه اصلی جامعه (قشر متوسط)، به منظور ایجاد
                  تجربه‌ی مفرح و با کیفیت یکسان در تمام شعب، برای مشتریان.
                </p>

                <a onClick={handleToggle}>مشاهده بیشتر</a>
              </div>
            </div>
          </div>
        </div>
      </section>
    </>
  );
}

export default About;
